hackffm/ESP32S3_OLED_Eyes/lib/hackffm_badge_lib/hackffm_badge_lib.cpp
// hackffm_badge_lib.cpp (cmd+K + cmd+0 to collapse)
#include "hackffm_badge_lib.h"

#include <WiFi.h>
#include <esp_wifi.h>
#include <WiFiMulti.h>
#include <elapsedMillis.h>
#include <Wire.h>
#if defined(ESP_ARDUINO_VERSION_MAJOR) && ESP_ARDUINO_VERSION_MAJOR >= 3
#include "esp_system.h"
#include "esp_mac.h"
#endif

#include <ArduinoOTA.h>
#include <ESPmDNS.h>
#include <HTTPClient.h>
#include <Update.h>
//#include <SimpleFTPServer.h>
#include <MultiFTPServer.h>

#include <esp_now.h>
#include <esp_log.h>
#include <Ed25519.h>

// Peter Schatzmann Libs for Audio and Tasks
#include "freertos-all.h"
#include "AudioTools.h"
#include "AudioTools/Disk/AudioSourceLittleFS.h"
#include "AudioTools/AudioCodecs/CodecMP3Helix.h"

#include "hal/usb_serial_jtag_ll.h"
//#include "hal/usb_phy_ll.h"

#include <vector>
#include <string>
#include <sstream>

#include "LL_Lib.h"

HackFFMBadgeLib HackFFMBadge;
HackFFMBadgeLib& Badge = HackFFMBadge;
Face face_inst(/* screenWidth = */ 128, /* screenHeight = */ 64, /* eyeSize = */ 40);

// Displays are selected in platformio.ini
//#define U8G2_DISPLAYTYPE U8G2_SSD1306_128X64_ADAFRUIT_F_HW_I2C  /* 0.96 inch */
//#define U8G2_DISPLAYTYPE U8G2_SSD1306_128X64_NONAME_F_HW_I2C  /* 0.96 inch */
//#define U8G2_DISPLAYTYPE U8G2_SH1106_128X64_NONAME_F_HW_I2C   /* 1.3 inch */
//#define U8G2_DISPLAYTYPE U8G2_SSD1309_128X64_NONAME0_F_HW_I2C /* 2.42 inch */
// 
U8G2_DISPLAYTYPE u8g2(U8G2_R0,  /* reset=*/ U8X8_PIN_NONE);
U8G2LOG u8g2log;
#define U8LOG_FONT u8g2_font_tom_thumb_4x6_tf
#define U8LOG_FONT_X  4
#define U8LOG_FONT_Y  6
#define U8LOG_WIDTH ((U8G2_DISP_WIDTH - 4) / U8LOG_FONT_X)
#define U8LOG_HEIGHT 6
uint8_t u8log_buffer[U8LOG_WIDTH*U8LOG_HEIGHT];

// Use these for Audio output
#define LEDC_CHANNEL_AUDIO 0
#define LEDC_RESOLUTION_AUDIO 8

#define FIRMWARE_URL "http://192.168.4.1/hackffmbadgev1_fw.bin"  // URL zur Firmware
#define VERSION_URL  "http://192.168.4.1/hackffmbadgev1_vers.txt"  // URL zur Versionsdatei

#define ESPNOW_CHANNEL 13
uint8_t espnow_tx_buf[ESP_NOW_MAX_DATA_LEN_V2 + 1]; // Buffer for ESPNOW Tx data
extern "C" void rom_phy_disable_cca();

FtpServer ftpSrv;

HardwareSerial UARTSerial(2);

I2SStream audio_i2s;
MP3DecoderHelix mp3_decoder;

void HackFFMBadgeLib::playMP3(const char *filename) {
  AudioInfo info(44100, 2, 16);

  const char *startFilePath="/";
  const char* ext="mp3";
  audio_tools::AudioSourceLittleFS source(startFilePath, ext);
  source.selectStream(filename);
  AudioPlayer player(source, audio_i2s , mp3_decoder);

  Badge.setPowerAudio(true);
  while(Serial.available()) Serial.read();

  LL_Log.println("Audio start");
  AudioToolsLogger.begin(Serial, AudioToolsLogLevel::Info);

  // setup output
  auto cfg = audio_i2s.defaultConfig(TX_MODE);
  cfg.copyFrom(info);
  cfg.signal_type = PDM; 
  cfg.pin_data = HackFFMBadge.pinAudio;
  cfg.pin_bck = 17; // need a clock pin for PDM even if not used
  audio_i2s.begin(cfg);

//  auto config = pwm.defaultConfig();
//  config.copyFrom(info);
//  config.start_pin = HackFFMBadge.pinAudio;
//  pwm.begin(config);
  

  // setup player
  //source.setFileFilter("*Bob Dylan*");
  player.setMetadataCallback([](MetaDataType type, const char* str, int len){
    Serial.print("==> ");
    Serial.print(toStr(type));
    Serial.print(": ");
    Serial.println(str);
  });
  player.setVolume(1.0);
  player.begin();
  
  while(!Serial.available() && player.isActive()) {
    player.copy();
  }
  LL_Log.println("Audio done");
  Badge.setPowerAudio(false);

}

/**
 * Protocol Tx:
 * Off Len
 *   0   4  Preemble "D00r"
 *   4  64  Signature
 *  68  32  Public Key
 * 100  32  Name (Cleartext UTF8, 0 filled)
 * 132   8  Challenge respone
 * 140   1  Command (might be longer than 1 if needed)   
 * 
 */
bool HackFFMBadgeLib::txCommand(const char *cmd) {
  uint8_t msg[4+64+32+32+8+8];
  int cmdlen = strlen(cmd);
  if(cmdlen > 8) cmdlen = 8;
  msg[0] = 'D'; msg[1] = '0'; msg[2] = '0'; msg[3] = 'r';
  memcpy(&msg[68], door_pubkey, 32);
  memcpy(&msg[100], door_name, 32);
  memcpy(&msg[132], lastChallenge, 8);
  memcpy(&msg[140], cmd, cmdlen+1);
  Ed25519::sign(&msg[4], door_prikey, door_pubkey, &msg[68], 32+32+8+cmdlen+1);
  esp_now_peer_info_t peer = {
    .peer_addr = {0xFF, 0xFF, 0xFF, 0xFF, 0xFF, 0xFF},
    .channel = ESPNOW_CHANNEL,
    .encrypt = false
  };
  ESP_ERROR_CHECK(esp_now_send(peer.peer_addr, msg, 4+64+32+32+8+cmdlen+1));
  return(true);
}

void HackFFMBadgeLib::saveKey() {
  char priKey[70];
  char pubKey[70];
  char name[33];
  memset(priKey, 0, sizeof(priKey));
  memset(pubKey, 0, sizeof(pubKey));
  memset(name, 0, sizeof(name));
  bytes2hex(door_prikey, 32, priKey);
  bytes2hex(door_pubkey, 32, pubKey);
  strlcpy(name, (char *)door_name, sizeof(name)-1);
  writeFile("/door_pri.txt", priKey);
  writeFile("/door_pub.txt", pubKey);
  writeFile("/door_nam.txt", name);
}

bool HackFFMBadgeLib::loadKey() {
  // Load key from file
  String loadPriKey = readFile("/door_pri.txt");
  String loadPubKey = readFile("/door_pub.txt");
  String loadName = readFile("/door_nam.txt");
  if(loadPriKey.length() < 64) return false;
  if(loadPubKey.length() < 64) return false;
  if(loadName.length() == 0) genDoorName();
  
  return loadKey(loadPriKey.c_str(), loadPubKey.c_str(), loadName.c_str());
}

bool HackFFMBadgeLib::loadKey(const char *priKey, const char *pubKey, const char *name) {
  size_t len = 0;
  len = hex2bytes(priKey, door_prikey, 32);
  if(len != 32) return false;
  len = hex2bytes(pubKey, door_pubkey, 32);
  if(len != 32) return false;  
  memset(door_name, 0, 32);
  strlcpy((char *)door_name, name, 31);
  uint8_t temp_pubkey[32];
  Ed25519::derivePublicKey(temp_pubkey, door_prikey);
  if(memcmp(temp_pubkey, door_pubkey, 32) != 0) return false;
  return true;
}  

bool HackFFMBadgeLib::genKey(const char *priKey) {
  if(priKey == NULL) {
    Ed25519::generatePrivateKey(door_prikey);
  } else {
    size_t len = 0;
    len = hex2bytes(priKey, door_prikey, 32);
    if(len != 32) return false;
  }
  Ed25519::derivePublicKey(door_pubkey, door_prikey);
  return true;
} 

// If no name is given, generate a name from the user name
void HackFFMBadgeLib::genDoorName(const char *name) {
  char namebuf[34];
  memset(namebuf, 0, sizeof(namebuf));
  if(name != NULL) {
    strlcpy(namebuf, name, sizeof(namebuf)-1);
  } else {
    snprintf(namebuf, sizeof(namebuf)-1, "HBdg %s", userName);
  }
  strlcpy((char *)door_name, namebuf, sizeof(door_name)-1);
} 



// Callback receive
#if defined(ESP_ARDUINO_VERSION_MAJOR) && ESP_ARDUINO_VERSION_MAJOR >= 3
void on_data_recv(const esp_now_recv_info_t *esp_now_info, const uint8_t *data, int len) {
  const uint8_t *mac_addr  = esp_now_info->src_addr;
  #else
void on_data_recv(const uint8_t *mac_addr, const uint8_t *data, int len) {
#endif  
  if(len > 1) {
    Badge.espNowRxMac[0] = mac_addr[0];
    Badge.espNowRxMac[1] = mac_addr[1];
    Badge.espNowRxMac[2] = mac_addr[2];
    Badge.espNowRxMac[3] = mac_addr[3];
    Badge.espNowRxMac[4] = mac_addr[4];
    Badge.espNowRxMac[5] = mac_addr[5];
    if(len > 252) len = 252;
    memcpy(Badge.espNowRxData, data, len);
    Badge.espNowRxDataLen = len;
    #if defined(ESP_ARDUINO_VERSION_MAJOR) && ESP_ARDUINO_VERSION_MAJOR >= 3
    Badge.espNowRxRssi = esp_now_info->rx_ctrl->rssi;
    #endif
  }
}

// Callback transmit
void on_data_sent(const uint8_t *mac, esp_now_send_status_t status) {
  if(status != ESP_NOW_SEND_SUCCESS) {
    Serial.printf("ESP-NOW Send failed, status: %d\r\n", status);
  } else {
    //Serial.write('°');
  }
}

bool HackFFMBadgeLib::tryFindDoor() {
  if(txDisplayChannel > 0) {
    LL_Log.println("ESP-Now used already for display tx!");
    return false;
  }
  // Open ESPNOW with timeout and send get challenge
  if(findDoorState > 0) {
    // LL_Log.println("Find door already in progress");
    if(findDoorState ==  2) return true;
    return false;
  }
  
  // WiFi-Init
  wifi_init_config_t cfg = WIFI_INIT_CONFIG_DEFAULT();
  ESP_ERROR_CHECK(esp_wifi_init(&cfg));
  ESP_ERROR_CHECK(esp_wifi_set_mode(WIFI_MODE_STA));
  ESP_ERROR_CHECK(esp_wifi_start());
  ESP_ERROR_CHECK(esp_wifi_set_channel(ESPNOW_CHANNEL, WIFI_SECOND_CHAN_NONE));

  // ESP-NOW-Init
  ESP_ERROR_CHECK(esp_now_init());
  esp_now_register_recv_cb(on_data_recv);
  esp_now_register_send_cb(on_data_sent);

  // Peer-Info konfigurieren (Broadcast)
  esp_now_peer_info_t peer = {
      .peer_addr = {0xFF, 0xFF, 0xFF, 0xFF, 0xFF, 0xFF},
      .channel = ESPNOW_CHANNEL,
      .encrypt = false
  };
  ESP_ERROR_CHECK(esp_now_add_peer(&peer));

