hackffm/ESP32S3_OLED_Eyes/lib/hackffm_badge_lib/hackffm_badge_lib.cpp
  wifi_phy_rate_t wifi_rate = WIFI_PHY_RATE_48M; // WIFI_PHY_RATE_MCS5_SGI;
 // wifi_rate = WIFI_PHY_RATE_LORA_250K;
 // wifi_rate = WIFI_PHY_RATE_1M_L;
  wifi_rate = WIFI_PHY_RATE_24M;
 // wifi_rate = WIFI_PHY_RATE_MCS5_LGI;
 
  esp_wifi_set_max_tx_power(44); // 11 dbm
  
  esp_wifi_set_protocol(WIFI_IF_STA, WIFI_PROTOCOL_11B|WIFI_PROTOCOL_11G|WIFI_PROTOCOL_11N /* |WIFI_PROTOCOL_LR */);
  #if defined(ESP_ARDUINO_VERSION_MAJOR) && ESP_ARDUINO_VERSION_MAJOR >= 3
  esp_now_rate_config_t en_rateconfig = {
    .phymode = WIFI_PHY_MODE_HT20, // WIFI_PHY_MODE_11G,
    .rate = WIFI_PHY_RATE_MCS0_LGI, // WIFI_PHY_RATE_MCS4_SGI,
    .ersu = false,   
    .dcm = false,
  };
  esp_now_set_peer_rate_config(peer.peer_addr, &en_rateconfig);
  #else
  esp_wifi_config_espnow_rate(WIFI_IF_STA,  wifi_rate);
  #endif

  txCommand("c");
  findDoorState = 1;
  findDoorTimeout = 0;

  return false;

}

void HackFFMBadgeLib::tryOpenDoor() {
  if(findDoorState == 2) {
    txCommand("O"); findDoorState++;
    findDoorTimeout = 0;
  }
}

void HackFFMBadgeLib::tryCloseDoor() {
  if(findDoorState == 2) {
    txCommand("C"); findDoorState++;
    findDoorTimeout = 0;
  }
}

bool HackFFMBadgeLib::txDisplaydata(int channel) {
  // Open ESPNOW with timeout and send get challenge
  if(findDoorState > 0) {
    // LL_Log.println("Find door already in progress");
    return false;
  }
  
  // Turn off if channel is 0
  if(channel < 1) {
    if((txDisplayChannel > 0) && (txDisplayChannel <= 13)) {
      esp_now_deinit();
      WiFi.mode(WIFI_OFF);
    }
    txDisplayChannel = 0;
    return false;
  }

  // Peer-Info konfigurieren (Broadcast)
  esp_now_peer_info_t peer = {
    .peer_addr = {0xFF, 0xFF, 0xFF, 0xFF, 0xFF, 0xFF},
    .channel = (uint8_t)channel,
    .encrypt = false
  };
  
  espnow_tx_buf[0] = 'B';
  espnow_tx_buf[1] = 'A';
  espnow_tx_buf[2] = 'D'; 
  espnow_tx_buf[3] = 'G';
  espnow_tx_buf[4] = 'S';
  espnow_tx_buf[5] = 'C'; 
  espnow_tx_buf[6] = 'R';
  espnow_tx_buf[7] = 'N';
  // put last 2 bytes of ESP Mac address into the buffer
  uint8_t mac[6];
  esp_err_t ret = esp_wifi_get_mac(WIFI_IF_STA, mac);
  espnow_tx_buf[8] =  mac[4];
  espnow_tx_buf[9] =  mac[5];
  // Set color for pixel = 0
  espnow_tx_buf[10] = 0; // Red
  espnow_tx_buf[11] = 0; // Green
  espnow_tx_buf[12] = 0; // Blue
  espnow_tx_buf[13] = 0; // Alpha
  // Set color for pixel = 1
  espnow_tx_buf[14] = 0xff; // Red
  espnow_tx_buf[15] = 0xff; // Green 
  espnow_tx_buf[16] = 0xff; // Blue
  espnow_tx_buf[17] = 0; // Alpha
  
  //espnow_tx_buf[14] = antennaLED.getPixelColor(0) >> 16; // Red
  //espnow_tx_buf[15] = antennaLED.getPixelColor(0) >> 8;  // Green
  //espnow_tx_buf[16] = antennaLED.getPixelColor(0) & 0xff; // Blue

  // Copy display data to buffer
  uint8_t *disbuf = u8g2.getBufferPtr();
  for(int i = 0; i < 128*64/8; i++) {
    espnow_tx_buf[18+i] = disbuf[i];
  }

  static elapsedMillis rateLimit = 0;

  if(channel <= 13) {
    if(channel != txDisplayChannel) {
      wifi_init_config_t cfg = WIFI_INIT_CONFIG_DEFAULT();
      ESP_ERROR_CHECK(esp_wifi_init(&cfg));
      ESP_ERROR_CHECK(esp_wifi_set_mode(WIFI_MODE_STA));
      ESP_ERROR_CHECK(esp_wifi_start());
      ESP_ERROR_CHECK(esp_wifi_set_channel((uint8_t)channel, WIFI_SECOND_CHAN_NONE));
    
      // ESP-NOW-Init
      ESP_ERROR_CHECK(esp_now_init());
      esp_now_register_recv_cb(on_data_recv);
      esp_now_register_send_cb(on_data_sent);
    
      ESP_ERROR_CHECK(esp_now_add_peer(&peer));
    
      esp_wifi_set_max_tx_power(60); // 11 dbm
      txDisplayChannel = channel;

      esp_wifi_set_protocol(WIFI_IF_STA, WIFI_PROTOCOL_11B|WIFI_PROTOCOL_11G|WIFI_PROTOCOL_11N /* |WIFI_PROTOCOL_LR */);

      esp_now_rate_config_t en_rateconfig = {
        .phymode = WIFI_PHY_MODE_HT20, // WIFI_PHY_MODE_11G,
        .rate = WIFI_PHY_RATE_MCS4_LGI,
       // .rate = WIFI_PHY_RATE_36M,
        .ersu = false,   
        .dcm = false,
      };
      esp_now_set_peer_rate_config(peer.peer_addr, &en_rateconfig);
      // rom_phy_disable_cca();
    }
    if(rateLimit > 20) {
      ESP_ERROR_CHECK(esp_now_send(peer.peer_addr, espnow_tx_buf, 1024+18));
      rateLimit = 0;
    }
  } else if (channel == 20) {
    // Use serial tx instead of ESPNOW
    if(channel != txDisplayChannel) {
      txDisplayChannel = channel;
      UARTSerial.setRxBufferSize(2048);
      UARTSerial.setTxBufferSize(2048);
      UARTSerial.begin(4000000, SERIAL_8N1, 44, 43); 
    }

    if(rateLimit >= 2) {
      UARTSerial.write(espnow_tx_buf, 1024+18);
      rateLimit = 0;
    }
  }    

  return true;
}

void HackFFMBadgeLib::begin() {
  // Face must be created early, maybe some memory initialization issues there in... (weird eyes come out)
  //if(face_) delete face_;
  //face_ = new Face(/* screenWidth = */ 128, /* screenHeight = */ 64, /* eyeSize = */ 40);
  face_ = &face_inst;

  // a little less sound at boot
  pinMode(5, OUTPUT); digitalWrite(5, LOW); 
  pinMode(6, OUTPUT); digitalWrite(6, LOW);
  pinMode(7, OUTPUT); digitalWrite(7, LOW);
  //pinMode(10, OUTPUT); pinMode(11, OUTPUT); digitalWrite(10, HIGH); digitalWrite(11, HIGH); 
  
  // Power on OLED
  // Conserve power (to allow CR123 battery operation)
  WiFi.mode(WIFI_OFF);
  delay(1);

  // Activate Serial but wait no longer than 1s to be ready
  Serial.begin(115200); // Baudrate does not matter as it is done via USB CDC...
  elapsedMillis serialUpTimeout = 0;
  while (!Serial && serialUpTimeout < 500) {
    delay(1);
  }
  LL_Log.begin(115200, 2222); // Serial baud (not used), TCP Port

  // Perform hardware detection
  detectHardware();

  // Initialize filesystem
  if(!LittleFS.begin()) {
    Serial.println("filesystem Mount Failed");
    return;
  }
  listDir("/", 0);
  
  // try to load user name from file
  String loadUserName = readFile("/name.txt");
  if(loadUserName.length() > 0) strlcpy(userName, loadUserName.c_str(), sizeof(userName)-1);
  
  // try to load host name from file
  uint8_t baseMac[6];
  #if defined(ESP_ARDUINO_VERSION_MAJOR) && ESP_ARDUINO_VERSION_MAJOR >= 3
  esp_read_mac(baseMac, ESP_MAC_EFUSE_FACTORY);
  #else
  esp_efuse_mac_get_default(baseMac);
  #endif
  Serial.printf(" Base MAC: %02X:%02X:%02X:%02X:%02X:%02X\r\n", 
    (unsigned int)baseMac[0], (unsigned int)baseMac[1], 
    (unsigned int)baseMac[2], (unsigned int)baseMac[3], 
    (unsigned int)baseMac[4], (unsigned int)baseMac[5]);
  delay(10);
  String loadHostName = readFile("/hostname.txt");
  if(loadHostName.length() > 0) strlcpy(hostName, loadHostName.c_str(), sizeof(hostName)-1);
  else {
    // Generate a random name
    sprintf(hostName, "hackffm-badge-%02X%02X%02X", (unsigned int)baseMac[3], (unsigned int)baseMac[4], (unsigned int)baseMac[5]);
  }
  Serial.printf(" HostName: %s\r\n", hostName);

