hackffm/ESP32S3_OLED_Eyes/lib/hackffm_badge_lib/hackffm_badge_lib.cpp
  // Try to load key from file
  if(loadKey() == false) {
    Serial.println(" loadKey failed - autogenerate new key");
    genKey();
    saveKey();
  } 
  
  char buf[70];
  //bytes2hex(door_prikey, 32, buf);
  //Serial.printf(" Door Private key: %s\r\n", buf);
  bytes2hex(door_pubkey, 32, buf);
  Serial.printf(" Door Public key:  %s\r\n", buf);
  Serial.printf(" Door Name: %s\r\n", door_name);

  // Start face and set some default values
  //if(face_) delete face_;
  //face_ = new Face(/* screenWidth = */ 128, /* screenHeight = */ 64, /* eyeSize = */ 40);
  faceActive = true;
  face().Expression.GoTo_Normal();
  face().Behavior.GoToEmotion(eEmotions::Normal);
  face().Behavior.SetEmotion(eEmotions::Normal, 0.8);
  face().Behavior.SetEmotion(eEmotions::Glee, 0.05);
  face().Behavior.SetEmotion(eEmotions::Worried, 0.05);
  face().Behavior.SetEmotion(eEmotions::Surprised, 0.05);
  face().Behavior.SetEmotion(eEmotions::Skeptic, 0.05);
  // Automatically switch between behaviours (selecting new behaviour randomly based on the weight assigned to each emotion)
  face().RandomBehavior = true;
  face().Behavior.Timer.SetIntervalMillis(6000); // 6s

  face().RandomBlink = true; // Automatically blink
  face().Blink.Timer.SetIntervalMillis(4000);

  // Automatically choose a new random direction to look
  //face().RandomLook = true;  


  delay(2000);
  Serial.println("HackFFM Badge initialized");
}

// Touch sensor update, ArduinoOTA and Face update
void HackFFMBadgeLib::update() {
  if(lastTouchRead > 50) {
    lastTouchRead = 0;
    for(int i = 0; i < NUM_TOUCH_PINS; i++) {
      touch[i].update();
    }
    lastTouchLU = (float)touch[0].getTouchValue() / 250.0;
    lastTouchLD = (float)touch[1].getTouchValue() / 250.0;
    lastTouchRU = (float)touch[2].getTouchValue() / 250.0;
    lastTouchRD = (float)touch[3].getTouchValue() / 250.0;
    lastTouchX = (-lastTouchLU) + (-lastTouchLD) + (lastTouchRU) + (lastTouchRD);
    lastTouchY = (-lastTouchLU) + (-lastTouchRU) + (lastTouchLD) + (lastTouchRD);
    touchUpdated = true;
  }

  // Update face without drawing
  if((faceActive) && (face_)) {
    face_->Update(true);
  }

  ArduinoOTA.handle();
  if(OTAinProgress == true) {
    for(int i=0; i<20; i++) {
      delay(10);
      ArduinoOTA.handle();
    }
  } 
  ftpSrv.handleFTP(); 

  if(findDoorState > 0) {
    if(findDoorTimeout > 4000) {
      findDoorState = 0;
      esp_now_deinit();
      WiFi.mode(WIFI_OFF);
      Serial.println("Find door timeout");
    } else {
      if(findDoorState < 10) {
        if(espNowRxDataLen > 0) {
          Serial.printf("RxLen: %d\r\n", espNowRxDataLen);
          // Check if it is valid Door protocol
          if(espNowRxDataLen >= (4+32+8+1)) {
            if(((espNowRxData[0] == 'D') && (espNowRxData[1] == '0') && (espNowRxData[2] == '0') && (espNowRxData[3] == 'a'))) {
              if(memcmp(&espNowRxData[4], door_pubkey, 32) == 0) {
                char cmd = espNowRxData[44];
                memcpy(lastChallenge, &espNowRxData[36], 8);
        
                switch (findDoorState)
                {
                  case 1: // challenge requested, expect now 'c'
                    if(cmd == 'c') { 
                      findDoorState++; 
                      int lenDoorName = espNowRxDataLen - 45;
                      if(lenDoorName > 32) lenDoorName = 32;
                      if(lenDoorName > 0) memcpy(door_name, &espNowRxData[45], lenDoorName);
                      door_name[lenDoorName] = 0;
                    } else findDoorState = 100;
                    //txCommand("t");
                    break;
        
                  case 3: // trigger requested, expect now 't'
                    if(cmd == 't') findDoorState++; else findDoorState = 100;
                    break;
                  
                  default:
                    break;
                }
                Serial.printf("RxCmd: %.*s\n", espNowRxDataLen-44, &espNowRxData[44]);
              }  
            }
          }
          
          espNowRxDataLen = 0;
        }
      }
    }
  }
    
}

void HackFFMBadgeLib::listDir(const char *dirname, uint8_t levels) {
  Serial.printf("Listing directory: %s\r\n", dirname);

  fs::File root = filesystem.open(dirname);
  if (!root) {
    Serial.println("- failed to open directory");
    return;
  }
  if (!root.isDirectory()) {
    Serial.println(" - not a directory");
    return;
  }

  fs::File file = root.openNextFile();
  while (file) {
    if (file.isDirectory()) {
      Serial.print("  DIR : ");
      Serial.println(file.name());
      if (levels) {
        listDir(file.path(), levels - 1);
      }
    } else {
      Serial.print("  FILE: ");
      Serial.print(file.name());
      Serial.print("\tSIZE: ");
      Serial.println(file.size());
    }
    file = root.openNextFile();
  }

  size_t t = LittleFS.totalBytes();
  size_t u = LittleFS.usedBytes();
  
  Serial.printf("Total space: %d, used space: %d, free space: %d\r\n", t, u, t - u);
}

// Function to write a string to a file
bool HackFFMBadgeLib::writeFile(const char *path, const String &data) {
  File file = filesystem.open(path, "w", true); // "w" overwrite file
  if (!file) {
    LL_Log.println("Can't open file to write");
      return false;
  }
  file.print(data);
  file.close();
  LL_Log.println("File written");
  return true;
}

// Function to read a file and return the content as a string
String HackFFMBadgeLib::readFile(const char *path) {
  String data = "";
  if(filesystem.exists(path) == false) {
    // LL_Log.printf("File %s does not exist\r\n", path);
    return data;
  }
  File file = filesystem.open(path, "r");  
  if (!file) {
    LL_Log.println("Can't open file for reading");
    return data;
  }
  while (file.available()) {
      data += (char)file.read();
  }
  file.close();
  return data;
}

void HackFFMBadgeLib::writeTone(uint32_t freq /* 0 to stop */, uint32_t duty) {
  if(pinAudio < 0) return;
  #if defined(ESP_ARDUINO_VERSION_MAJOR) && ESP_ARDUINO_VERSION_MAJOR >= 3
    if(freq == 0) {
      ledcDetach(pinAudio);
    } else {
      ledcAttachChannel(pinAudio, freq, LEDC_RESOLUTION_AUDIO, LEDC_CHANNEL_AUDIO);
      ledcWrite(pinAudio, duty);
    }
  #else
    if(freq == 0) {
      ledcDetachPin(pinAudio);
    } else {
      ledcSetup(LEDC_CHANNEL_AUDIO, freq, LEDC_RESOLUTION_AUDIO);
      ledcAttachPin(pinAudio, LEDC_CHANNEL_AUDIO);
      ledcWrite(LEDC_CHANNEL_AUDIO, duty);
    }
  #endif
}

void HackFFMBadgeLib::drawLog(bool noDraw) {
  // Align Log-box from lower-left corner
  int logbox_y = u8g2.getDisplayHeight() - (U8LOG_HEIGHT * U8LOG_FONT_Y) - 3;
  u8g2.setFont(U8LOG_FONT);
  u8g2.setFontPosTop();
  u8g2.setFontMode(0);
  u8g2.setDrawColor(1);
  u8g2.drawBox(0,logbox_y,u8g2.getDisplayWidth(),u8g2.getDisplayHeight()-logbox_y);
  u8g2.setDrawColor(0);
  u8g2.drawBox(1,logbox_y+1,u8g2.getDisplayWidth()-2,u8g2.getDisplayHeight()-(logbox_y+2));
  u8g2.setDrawColor(1);
  u8g2.drawLog(2,logbox_y+1,u8g2log);
  if(!noDraw) u8g2.sendBuffer();  
  u8g2.setDrawColor(1);
}

// BMP-Header-Struktur
struct __attribute__((packed)) BMPHeader {
  uint16_t signature;
  uint32_t fileSize;
  uint32_t reserved;
  uint32_t dataOffset;
  uint32_t headerSize;
  int32_t width;
  int32_t height;
  uint16_t planes;
  uint16_t bitsPerPixel;
};

void HackFFMBadgeLib::drawBMP(const char *filename, bool noDraw) {
  File file = filesystem.open(filename, "r");
  if (!file) {
      Serial.println("Can't open file!");
      return;
  }

