hackffm/ESP32S3_OLED_Eyes/lib/hackffm_badge_lib/hackffm_badge_lib.cpp
  BMPHeader header;
  file.read((uint8_t *)&header, sizeof(BMPHeader));

  /*
  Serial.printf("Signature: %x\r\n", header.signature);
  Serial.printf("Filesize: %d\r\n", header.fileSize);   
  Serial.printf("DataOffset: %d\r\n", header.dataOffset);
  Serial.printf("HeaderSize: %d\r\n", header.headerSize);
  Serial.printf("Width: %d\r\n", header.width); 
  Serial.printf("Height: %d\r\n", header.height);
  Serial.printf("Planes: %d\r\n", header.planes);
  Serial.printf("BitsPerPixel: %d\r\n", header.bitsPerPixel);
  */

  if (header.signature != 0x4D42 || header.bitsPerPixel != 1) {
      Serial.println("BMP-Format not supported!");
      file.close();
      return;
  }

  int width = header.width;
  int height = abs(header.height);
  bool flip = (header.height > 0);
  int rowSize = ((width + 31) / 32) * 4;
  uint8_t rowBuffer[rowSize];

  //u8g2.clearBuffer(); 

  for (int y = 0; y < height; y++) {
      int rowIndex = flip ? (height - 1 - y) : y;
      file.seek(header.dataOffset + rowIndex * rowSize, SeekSet);
      file.read(rowBuffer, rowSize);

      for (int x = 0; x < width; x++) {
          int byteIndex = x / 8;
          int bitIndex = 7 - (x % 8);
          bool pixel = (rowBuffer[byteIndex] >> bitIndex) & 1;
          u8g2.setDrawColor(pixel ? 1 : 0);
          u8g2.drawPixel(x, y);
      }
  }
  file.close();

  if(!noDraw) u8g2.sendBuffer();  
  u8g2.setDrawColor(1);
}

/* Special characters:
 * 0x0a \n: new line
 * $: Escape, next char defines action
 *    $: prints $
 *    c,l,r: center/left/right aligned
 *    0..9,a,b,d,e,f,g: set fonts
 *    !: clear display
 */
void HackFFMBadgeLib::drawString(const char *str, int x, int y, int dy, bool noDraw) {
  if(!OledAddress) return;
  char buf[512];
  char c;
  int  idx = 0;
  int w = u8g2.getDisplayWidth();
  int sw = 0; // getUTF8Width(
  int dsFlags = 0;
  int newX = x;

   do {
    c = *str++;
    if(c>=' ') {
      if(dsFlags & 1) {
        dsFlags &= ~(1);
        switch(c) {
          case '$': buf[idx++] = c; break;
          case 'n': c = '\n'; goto LINEFEED; break;
          case '!': u8g2.clearBuffer(); break;
          case '+': y++; break;
          case '-': y--; break;
          case 'c':
            dsFlags &= ~(6);
            dsFlags |= 2;
            break;
          case 'l':
            dsFlags &= ~(6);
            break; 
          case 'r':
            dsFlags &= ~(6);
            dsFlags |= 4;
            break;
          // Fonts
          case '0': u8g2.setFont(u8g2_font_tinyunicode_tf); break; // 27  
          case '1': u8g2.setFont(u8g2_font_nokiafc22_tf); break; // 22.2  
          case '2': u8g2.setFont(u8g2_font_busdisplay11x5_te); break;   // 21.5
          case '3': u8g2.setFont(u8g2_font_sonicmania_te); break; // 19.1          nice bold
          case 'E': u8g2.setFont(u8g2_font_prospero_bold_nbp_tf); break; // ?          nice bold
          case '4': u8g2.setFont(u8g2_font_DigitalDiscoThin_tf); break; // 16.2
          case '5': u8g2.setFont(u8g2_font_scrum_tf); break; // 16 a
          case '6': u8g2.setFont(u8g2_font_DigitalDisco_tf); break; // 16 b        nice bold
          case 'G': u8g2.setFont(u8g2_font_profont17_tf); break; // 16 b        nice bold
          case '7': u8g2.setFont(u8g2_font_fur11_tf); break; // 16 c
          case '8': u8g2.setFont(u8g2_font_Pixellari_tf); break; // 15.5           nice bold
          case '9': u8g2.setFont(u8g2_font_fub11_tf); break; // 14.1
          case 'a': u8g2.setFont(u8g2_font_lucasarts_scumm_subtitle_o_tf); break; // 12
          case 'b': u8g2.setFont(u8g2_font_lucasarts_scumm_subtitle_r_tf); break; // 12          
          case 'd': u8g2.setFont(u8g2_font_fur14_tf); break; // 11.5
          case 'e': u8g2.setFont(u8g2_font_fub14_tf); break; // 11.5
          case 'f': u8g2.setFont(u8g2_font_chargen_92_tf); break; //10.9
          case 'g': u8g2.setFont(u8g2_font_inr21_mf); break; // ?
        //  case 's': u8g2.setFont(u8g2_font_sticker100complete_te); break; // ?
        //  case 'i': u8g2.setFont(u8g2_font_m2icon_9_tf); break;
                             
        }
      } else {
        if(c=='$') {
          dsFlags |= 1;
        } else {
          buf[idx++] = c;
        }        
      }
    } else {
      LINEFEED:
      switch(c) {
        case 0:
        case '\n':
          buf[idx] = 0;
          sw = u8g2.getUTF8Width(buf);
          if(dsFlags & 2) {
            // centered (plus offsetted by x)
            newX = (w - sw)/2 + x;
          } else if(dsFlags & 4) {
            // right (minus offsetted by x)
            newX = (w - sw) - x;
          } else {
            newX = x;
          }
          y += u8g2.getAscent()-u8g2.getDescent()+dy;
          u8g2.drawUTF8(newX,y,buf);
          idx = 0;
          break; 
      }
    }
  } while(c);

  if(!noDraw) u8g2.sendBuffer();

}

// Function to retrieve name without all $-Escape squences removed
String HackFFMBadgeLib::getCleanName(const char *str) {
  String name = "";
  char c;
  int  idx = 0;
  int  len = strlen(str);
  int  dsFlags = 0; 

  do {
    c = *str++;
    if(dsFlags & 1) {
      dsFlags &= ~(1);
      switch(c) {
        case '$': name += c; break;
        case 'n': c = '\n'; name += c; break;
        default: break;       
      }
    } else {
      if(c=='$') {
        dsFlags |= 1;
      } else {
        name += c;
      }        
    }
  } while((c) && (idx++ < len));  
  return name;
}

// Helper function: split string by delimiter
static std::vector<std::string> split(const std::string &s, char delimiter) {
    std::vector<std::string> tokens;
    std::stringstream ss(s);
    std::string item;
    while (std::getline(ss, item, delimiter)) {
        tokens.push_back(item);
    }
    return tokens;
}

// Helper: split string by delimiter (keeps behavior for "\n")
static std::vector<std::string> splitByChar(const std::string &s, char delim) {
    std::vector<std::string> out;
    std::string cur;
    for (char c : s) {
        if (c == delim) {
            out.push_back(cur);
            cur.clear();
        } else {
            cur.push_back(c);
        }
    }
    out.push_back(cur);
    return out;
}

// Helper: determine UTF-8 character length from the first byte
static size_t utf8_char_len(unsigned char c) {
    if ((c & 0x80) == 0x00) return 1;
    if ((c & 0xE0) == 0xC0) return 2;
    if ((c & 0xF0) == 0xE0) return 3;
    if ((c & 0xF8) == 0xF0) return 4;
    return 1; // fallback (invalid byte)
}

