hackffm/ESP32S3_OLED_Eyes/lib/hackffm_badge_lib/hackffm_badge_lib.cpp
// Function to draw UTF-8 centered multiline text with auto line-breaking
int HackFFMBadgeLib::drawCenteredUTF8Text(const char *str, bool noDraw) {
    // font list: descending sizes
    const uint8_t* fonts[] = {
        u8g2_font_helvB24_tf,
        u8g2_font_helvB18_tf,
        u8g2_font_helvB14_tf,
        u8g2_font_helvB12_tf,
        u8g2_font_helvB10_tf,
        u8g2_font_helvB08_tf
    };
    const int fontCount = sizeof(fonts) / sizeof(fonts[0]);

    std::string input = str ? str : "";

    for (int fontIndex = 0; fontIndex < fontCount; ++fontIndex) {
        u8g2.setFont(fonts[fontIndex]);
        u8g2.setFontPosBaseline();

        int ascent = u8g2.getAscent();
        int descent = -u8g2.getDescent();
        int lineHeight = ascent + descent;

        int displayW = u8g2.getDisplayWidth();
        int displayH = u8g2.getDisplayHeight();

        std::vector<std::string> finalLines;
        bool tooWide = false;

        // Split into paragraphs by \n
        std::vector<std::string> paragraphs = splitByChar(input, '\n');

        for (const auto &para : paragraphs) {
            std::istringstream iss(para);
            std::string word, line;

            while (iss >> word) {
                int wordWidth = u8g2.getUTF8Width(word.c_str());
                if (wordWidth > displayW) {
                    // A single word doesn't fit on screen -> try smaller font
                    tooWide = true;
                    break;
                }

                std::string testLine = line.empty() ? word : line + " " + word;
                if (u8g2.getUTF8Width(testLine.c_str()) <= displayW) {
                    line = testLine;
                } else {
                    finalLines.push_back(line);
                    line = word;
                }
            }
            if (tooWide) break;
            if (!line.empty()) finalLines.push_back(line);
        }

        if (tooWide) continue;

        int totalHeight = finalLines.size() * lineHeight;
        if (totalHeight > displayH) continue;  // text block too tall for this font

        // Everything fits → render centered
        u8g2.clearBuffer();

        int firstBaselineY = (displayH - totalHeight) / 2 + ascent;
        for (size_t i = 0; i < finalLines.size(); ++i) {
            int lineW = u8g2.getUTF8Width(finalLines[i].c_str());
            int x = (displayW - lineW) / 2;
            int y = firstBaselineY + (int)i * lineHeight;
            u8g2.drawUTF8(x, y, finalLines[i].c_str());
        }

        if(!noDraw) u8g2.sendBuffer();
        return fontIndex;  // success
    }

    // nothing fit
    return -1;
}



void HackFFMBadgeLib::initOLED() {
  // Unlike almost every other Arduino library (and the I2C address scanner script etc.)
  // u8g2 uses 8-bit I2C address, so we shift the 7-bit address left by one
  u8g2.setI2CAddress(OledAddress<<1);
  u8g2.begin();
  u8g2.enableUTF8Print();

  // make it faster
  u8g2.setBusClock(1000000UL);

  // dim display down
  //u8g2.sendF("ca", 0xdb, 0); // not for SH1106 - need af (e3) afterwards
  //u8g2.sendF("ca", 0xd9, 0x2f);
  //u8g2.sendF("ca", 0xaf); // reactivate if display turns off (SH1106 need it)
  //u8g2.setContrast(0x32); // u8g2.sendF("ca", 0x81, 32);
  String BootMsg = "$!$c$6HackFFM Badge V1\n";
  BootMsg += String(__DATE__) + "\n" + String(__TIME__);

  drawString(BootMsg.c_str());

  u8g2log.begin(U8LOG_WIDTH, U8LOG_HEIGHT, u8log_buffer);	// assign only buffer, update full manual
  u8g2log.print("u8g2log:\r\n");
}

void HackFFMBadgeLib::detectHardware() {
  pinVariantIndex = 0; OledAddress = 0;

  // Try to detect blue or black board by checking GPIO3
  pinMode(3, OUTPUT);
  digitalWrite(3, HIGH);
  delay(2);
  pinMode(3, INPUT_PULLUP);
  delay(2);
  int pina3 = analogRead(3);  // black: 2933, 2955  blue: 3685
  Serial.printf("GPIO3 ADC: %d\n", pina3);
  if((pina3 > 2700) && (pina3 < 3200)) {
    boardType = 2; // black
    boardLED.setPin(48);
  } else if(pina3 > 3200) {
    boardType = 1; // blue
    boardLED.setPin(21);
  } else {
    boardType = 0; // unknown
  }
  Serial.printf("BoardType: %s\n", boardTypeTexts[boardType]);

  boardLED.begin();
  setBoardLED(0, 1, 0); // green dark

  // Try find OLED display which defines board variant
  int ret = 0;  // 0: not found
  for(int i = 1; i < NUM_PIN_VARIANTS; i++) {
    TwoWire WireTemp = TwoWire(0);
    //WireTemp.endTransmission();
    WireTemp.begin(pinVariants[i][0], pinVariants[i][1], 100000);
    WireTemp.beginTransmission(0x3c);
    if(WireTemp.endTransmission() == 0) {
      WireTemp.end();
      OledAddress = 0x3c;
      ret = i;
      break;
    }
    WireTemp.beginTransmission(0x3d);
    if(WireTemp.endTransmission() == 0) {
      WireTemp.end();
      OledAddress = 0x3d;
      ret = i;
      break;
    }
    WireTemp.end();
  }

  // Set pins according to detected variant
  pinVariantIndex = ret;
  pinOledSda  = pinVariants[pinVariantIndex][0];
  pinOledSck  = pinVariants[pinVariantIndex][1];
  pinPwrHold  = pinVariants[pinVariantIndex][2];
  pinAudio    = pinVariants[pinVariantIndex][3];
  pinAudioEn  = pinVariants[pinVariantIndex][4];
  pinTouchLU  = pinVariants[pinVariantIndex][5];
  pinTouchLD  = pinVariants[pinVariantIndex][6];
  pinTouchRU  = pinVariants[pinVariantIndex][7];
  pinTouchRD  = pinVariants[pinVariantIndex][8];
  pinNeoPixel = pinVariants[pinVariantIndex][9];
  pinExtA     = pinVariants[pinVariantIndex][10];
  pinExtB     = pinVariants[pinVariantIndex][11];
  pinBoardRGB = pinVariants[pinVariantIndex][12];
  pinBoardTx  = pinVariants[pinVariantIndex][13];
  pinBoardRx  = pinVariants[pinVariantIndex][14];

  // Set pins
  pinMode(0, INPUT_PULLUP); // Button
  pinMode(pinBoardRx, INPUT_PULLUP);

  // Set power hold active
  setPowerHold(true);

  // Re-Init NeoPixel
  if(pinBoardRGB >= 0) {
    boardLED.setPin(pinBoardRGB);
    boardLED.begin();
  }
  if(pinNeoPixel >= 0) {
    antennaLED.setPin(pinNeoPixel);
    antennaLED.begin();
  }


  // Init OLED display if found or blink red-blue 5 times
  if(ret >= 1) {
    Wire.begin(pinOledSda, pinOledSck, 400000);
    initOLED();
    Serial.printf("OLED Display found at 0x%02x on SDA=%d, SCK=%d\n", OledAddress, pinOledSda, pinOledSck);
    switch(pinVariantIndex) {
      case 1: Serial.println("Badge PCB V2, blue  ESP32-S3-Zero"); break;
      case 2: Serial.println("Badge PCB V2, black ESP32-S3 Super Mini"); break;
      default: Serial.println("Unknown variant"); break;
    }
    setBoardLED(0, 1, 0); // green dark
    antennaLED.fill(12, 4, 0); // orange
    setAntennaLED(12, 4, 0); 
  } else {
    Serial.println("No OLED display found - detection of variant not possible, other hardware not available!");

