hackffm/ESP32S3_OLED_Eyes/lib/hackffm_badge_lib/hackffm_badge_lib.cpp
    // blink red-blue 5 times
    for(int i = 0; i < 5; i++) {
      setBoardLED(4, 0, 0); 
      setAntennaLED(4, 0, 0);
      delay(500);
      setBoardLED(0, 0, 4); 
      setAntennaLED(0, 0, 4);
      delay(500);
    }
    // stay red dark
    setBoardLED(1, 0, 0);
    setAntennaLED(1, 0, 0);
    
  }

  // Output some HW-Informations
  uint32_t chipId = 0;
  for (int i = 0; i < 17; i = i + 8) {
    chipId |= ((ESP.getEfuseMac() >> (40 - i)) & 0xff) << i;
  }
  Serial.printf(" ESP32 Chip model = %s Rev %d\n", ESP.getChipModel(), ESP.getChipRevision());
  Serial.printf(" This chip has %d cores, Chip ID: %08x\n", ESP.getChipCores(), chipId);
  Serial.printf(" Silicon revision: %d\n", ESP.getChipRevision());
  Serial.printf(" CPU Frequency: %d MHz\n", ESP.getCpuFreqMHz());
  Serial.printf(" Free heap RAM: %u Bytes\n", (uint32_t)ESP.getFreeHeap());
  Serial.printf(" Total flash: %u Bytes\n", (uint32_t)ESP.getFlashChipSize());
  Serial.printf(" Flash for main program: %u Bytes\n", (uint32_t)ESP.getFreeSketchSpace());
  Serial.printf(" PSRAM size: %u Bytes\n", (uint32_t)ESP.getPsramSize());
  Serial.printf(" SDK version: %s\n", ESP.getSdkVersion());
  Serial.printf(" ESP32 Arduino version: %d.%d.%d\n", ESP_ARDUINO_VERSION_MAJOR, ESP_ARDUINO_VERSION_MINOR, ESP_ARDUINO_VERSION_PATCH); 
  

  // Init touch processors
  touch[0] = touchProcessor(pinTouchLU);
  touch[1] = touchProcessor(pinTouchLD);
  touch[2] = touchProcessor(pinTouchRU);
  touch[3] = touchProcessor(pinTouchRD);

  setPowerAudio(false);
}

void HackFFMBadgeLib::playStartSound() {
  // play tone duh-duett
  setPowerAudio(true);

  /*
  delay(100);
  writeTone(784); // G5
  delay(300);
  writeTone(1047); // C6
  delay(300);
  */
  

  delay(500);
  writeTone(660);

  
  delay(100);
  writeTone(0);
  delay(150);

  writeTone(660);
  delay(100);
  writeTone(0);
  delay(300);

  writeTone(660);
  delay(100);
  writeTone(0);
  delay(300);

  writeTone(510);
  delay(100);
  writeTone(0);
  delay(100);

  writeTone(660);
  delay(100);
  writeTone(0);
  delay(300);

  writeTone(770);
  delay(100);
  writeTone(0);
  delay(550);

  writeTone(380);
  delay(100);
  writeTone(0);
   
  delay(575);

 

  writeTone(0); // stop tone
  setPowerAudio(false);

}

const int HackFFMBadgeLib::pinVariants[][HackFFMBadgeLib::PINS_PER_VARIANT] = {
/**
 * Supported MCU boards:
 *  https://www.waveshare.com/wiki/ESP32-S3-Zero  
 *    PCB color blue, 4MB Flash, 2MB PSRAM
 *    GPIO21 RGB-LED, GPIO43 TX, GPIO44 RX, GPIO0 BOOT-Button 
 *    LDO has 100mV drop at 300mA -> Connect battery to 5V input should be feasible
 * 
 *  https://forum.fritzing.org/t/part-request-esp32-s3-supermini/22633 Tenstar Robot
 *    PCB color black, 4MB Flash, 2MB PSRAM
 *    GPIO48 RGB-LED + LED red, GPIO43 TX, GPIO44 RX, GPIO0 BOOT-Button
 *    GPIO3 has some weird resistor divider to 2.5V that breaks the touch sensor
 *    This board has an interal battery charger that blinks a blue LED also when no battery is connected
 * 
 */
  //  OledSda         AudioEn         TouchRD C       BoardRGB
  //      OledSck         TouchLU B       NeoPixel        BoardTx
  //          PwrHold         TouchLD A       ExtA            BoardRx
  //              Audio           TouchRU D       ExtB
    { -1, -1, -1, -1, -1, -1, -1, -1, -1, 48, -1, -1, 21, 43, 44},  // unknown, try to activate RGB-LEDs
    { 8,  7,  10, 6,  5,  4,  1,  11, 12, 9,  2,  3,  21, 43, 44},  // Badge PCB V2, blue  ESP32-S3-Zero
    { 9,  8,  11, 7,  6,  5,  2,  12, 13, 10, 3,  4,  48, 43, 44},  // Badge PCB V2, black ESP32-S3 Super Mini
};

const int HackFFMBadgeLib::NUM_PIN_VARIANTS = sizeof(HackFFMBadgeLib::pinVariants) / sizeof(HackFFMBadgeLib::pinVariants[0]);

const char* const HackFFMBadgeLib::boardTypeTexts[] = {"unknown", "blue", "black"};

void HackFFMBadgeLib::setBoardLED(uint32_t rgb) {
  setBoardLED(rgb >> 16, rgb >> 8, rgb);
}

void HackFFMBadgeLib::setBoardLED(uint8_t r, uint8_t g, uint8_t b) {
  //if(freenoveBoardLED) {
  //  freenoveBoardLED->setLedColor(0, r, g, b);
 // } 
  boardLED.setPixelColor(0, r, g, b);
  boardLED.show();  
}

void HackFFMBadgeLib::setAntennaLED(uint32_t rgb) {
  setAntennaLED(rgb >> 16, rgb >> 8, rgb);
}

void HackFFMBadgeLib::setAntennaLED(uint8_t r, uint8_t g, uint8_t b) {
  //if(freenoveAntennaLED) {
  //  freenoveAntennaLED->setLedColor(0, r, g, b);
  //} 
  antennaLED.setPixelColor(0, r, g, b);
  antennaLED.show();
}

void HackFFMBadgeLib::powerOff() {  
  // Power off the badge
  // Turn off the RGB-LEDs
  setBoardLED(0, 0, 0);
  setAntennaLED(0, 0, 0);

  // Turn off the OLED display
  u8g2.setPowerSave(1);

  // Turn off the audio amplifier
  setPowerAudio(false);

  // Turn off the battery
  setPowerHold(false);

  delay(1000);

  // Turn off the ESP32-S3
  esp_deep_sleep_start();

}

void HackFFMBadgeLib::setPowerHold(bool on) {
  if(pinPwrHold >= 0) {
    pinMode(pinPwrHold, OUTPUT);
    digitalWrite(pinPwrHold, on?HIGH:LOW);
  }
}

void HackFFMBadgeLib::setPowerAudio(bool on) {
  if(pinAudioEn >= 0) {
    pinMode(pinAudioEn, OUTPUT);
    digitalWrite(pinAudioEn, on?LOW:HIGH);
  }
}

uint32_t HackFFMBadgeLib::but0PressedSince() {
  uint32_t  ret = 0;
  if(digitalRead(0) == LOW) {
    if(but0LastPressed == false) {
      // is pressed, was not pressed before
      but0LastPressed = true;
      but0CurrentPressedMs = 0;
      ret = 0; // We don't know how long it was pressed before...
    } else {  
      ret = (uint32_t)but0CurrentPressedMs;
    }
  } else {
    if(but0LastPressed == false) {
      // is not pressed and was not pressed before
      ret = 0;
    } else {
      // is not pressed, but was pressed before
      ret = 0; // as it is not pressed any longer
      but0LastPressed = false;
      but0WasPressedForMs = (uint32_t)but0CurrentPressedMs;
      but0CurrentPressedMs = 0;
    } 
  }
  return ret;
}

uint32_t HackFFMBadgeLib::but0PressedFor() {
  but0PressedSince(); // call to update but0WasPressedForMs
  uint32_t ret = but0WasPressedForMs;
  but0WasPressedForMs = 0;
  return ret;
}

bool HackFFMBadgeLib::connectWifi(const char* ssid, const char* password) {
  bool ret = false;
  WiFi.setHostname(hostName);
  WiFi.mode(WIFI_STA);
  WiFi.begin(ssid, password);
  WiFi.setTxPower(WIFI_POWER_7dBm);
  //WiFi.setSleep(true);
  int tries = 0;
  LL_Log.println("Connecting to WiFi..");
  while ((WiFi.status() != WL_CONNECTED) && (tries < 20)) {
    delay(500);
    LL_Log.print(".");
    tries++;
  }
  if(WiFi.status() == WL_CONNECTED) {
    LL_Log.print("Connected to ");
    LL_Log.println(ssid);
    LL_Log.print("IP address: ");
    LL_Log.println(WiFi.localIP());
    setupOTA();
  
